// №13 Напишите программу, 
// которая выводит третью цифру 
// заданного числа или сообщает, что третьей цифры нет.
// * Сделать вариант для числа длиной до 10 цифр не используя char или string

Console.WriteLine("Введите цисло от 1 до 9999999999"); 
 int number = int.Parse.ToArray((Console.ReadLine())?? "0");
 //int num2 = int.Parse.ToArray(number);

    //int[] numbers = new int[Console.ReadLine()?? "0"]; 
    //int item = 2;
    //int index = numbers.findIndex(2);

    //Console.WriteLine(number);

    int[] nums = { 1, 2, 3, 5 };
 
// получение элемента массива
Console.WriteLine(nums[3]);  // 5

    //int day = int.Parse(Console.ReadLine ()??"0");
// string [] dayOfWeek = new string [7]; // создание массива dayOfWeek длинной 7
//     dayOfWeek[0] = "Понедельник";
//     dayOfWeek[1] = "Вторник";
//     dayOfWeek[2] = "Среда";
//     dayOfWeek[3] = "Четверг";
//     dayOfWeek[4] = "Пятница";
//     dayOfWeek[5] = "Суббота";
//     dayOfWeek[6] = "Воскресение";
// Console.WriteLine(dayOfWeek [day-1]);